In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import sqlite3

# Data Acquisition Lecture Notes

## Pandas objects

In [2]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [3]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [4]:
frame = pd.DataFrame({
    'col1': [1, 2, 4],
    'col2': [6, 7 , 10],
})

In [5]:
frame['col1']

0    1
1    2
2    4
Name: col1, dtype: int64

```python
frame[ [put a list here] ]
```

In [6]:
frame.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
frame.index.values

array([0, 1, 2], dtype=int64)

## CSV

In [25]:
accidents = pd.read_csv("./data/accidents.csv")

In [26]:
accidents

  Miles from Home  % of Accidents
0     less than 1              23
1          1 to 5              29
2         6 to 10              17
3        11 to 15               8
4        16 to 20               6
5         over 20              17

In [24]:
accidents.dtypes

Miles from Home    object
% of Accidents      int64
dtype: object

In [33]:
accidents[2::2]

  Miles from Home  % of Accidents
2         6 to 10              17
4        16 to 20               6

In [34]:
accidents["Miles from Home"]

0    less than 1
1         1 to 5
2        6 to 10
3       11 to 15
4       16 to 20
5        over 20
Name: Miles from Home, dtype: object

In [35]:
accidents.shape

(6, 2)

In [36]:
accidents.head(3)

  Miles from Home  % of Accidents
0     less than 1              23
1          1 to 5              29
2         6 to 10              17

In [37]:
accidents.columns

Index(['Miles from Home', '% of Accidents'], dtype='object')

In [38]:
accidents.index

RangeIndex(start=0, stop=6, step=1)

## API

In [102]:
cats = pd.read_json('https://cataas.com/cat?json=true')

In [100]:
cats = pd.read_json('https://cataas.com/api/cats?limit=5')

In [103]:
cats

,id,created_at,tags,url
0,62688214a9716a001738b882,2022-04-26 23:36:52.182000+00:00,Cat,/cat/62688214a9716a001738b882
1,62688214a9716a001738b882,2022-04-26 23:36:52.182000+00:00,Sniper,/cat/62688214a9716a001738b882
2,62688214a9716a001738b882,2022-04-26 23:36:52.182000+00:00,Scout,/cat/62688214a9716a001738b882

In [105]:
url = 'https://cataas.com/' + cats['url'][0]
plt.

'/cat/62688214a9716a001738b882'

## SLQ

In [9]:
con = sqlite3.connect('data/db.sqlite3')

In [10]:
cur = con.cursor()

In [11]:
cur.execute('''CREATE TABLE stocks
               (date text, trans text, symbol text, qty real, price real)''')

In [12]:
# Insert a row of data
cur.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")

# Save (commit) the changes
con.commit()

# We can also close the connection if we are done with it.
# Just be sure any changes have been committed or they will be lost.
con.close()

In [14]:
con = sqlite3.connect('data/db.sqlite3')
cur = con.cursor()

for row in cur.execute('SELECT * FROM stocks ORDER BY price'):
    print(row)

('2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)

## Excel

In [16]:
trips = pd.read_excel("data/green_tripdata_2015-09.xls")

In [17]:
trips.head()

,VendorID,lpep_pickup_datetime,Lpep_dropoff_datetime,Store_and_fwd_flag,RateCodeID,Pickup_longitude,Pickup_latitude,Dropoff_longitude,Dropoff_latitude,Passenger_count,...,Fare_amount,Extra,MTA_tax,Tip_amount,Tolls_amount,Ehail_fee,improvement_surcharge,Total_amount,Payment_type,Trip_type
0,2,2015-09-01 00:02:34,2015-09-01 00:02:38,N,5,-73.979485,40.684956,-73.979431,40.685020,1,...,7.8,0.0,0.0,1.95,0.0,NaN,0.0,9.75,1,2
1,2,2015-09-01 00:04:20,2015-09-01 00:04:24,N,5,-74.010796,40.912216,-74.010780,40.912212,1,...,45.0,0.0,0.0,0.00,0.0,NaN,0.0,45.00,1,2
2,2,2015-09-01 00:01:50,2015-09-01 00:04:24,N,1,-73.921410,40.766708,-73.914413,40.764687,1,...,4.0,0.5,0.5,0.50,0.0,NaN,0.3,5.80,1,1
3,2,2015-09-01 00:02:36,2015-09-01 00:06:42,N,1,-73.921387,40.766678,-73.931427,40.771584,1,...,5.0,0.5,0.5,0.00,0.0,NaN,0.3,6.30,2,1
4,2,2015-09-01 00:00:14,2015-09-01 00:04:20,N,1,-73.955482,40.714046,-73.944412,40.714729,1,...,5.0,0.5,0.5,0.00,0.0,NaN,0.3,6.30,2,1

In [18]:
trips.shape

(65535, 21)

In [19]:
trips.dtypes

VendorID                          int64
lpep_pickup_datetime     datetime64[ns]
Lpep_dropoff_datetime    datetime64[ns]
Store_and_fwd_flag               object
RateCodeID                        int64
Pickup_longitude                float64
Pickup_latitude                 float64
Dropoff_longitude               float64
Dropoff_latitude                float64
Passenger_count                   int64
Trip_distance                   float64
Fare_amount                     float64
Extra                           float64
MTA_tax                         float64
Tip_amount                      float64
Tolls_amount                    float64
Ehail_fee                       float64
improvement_surcharge           float64
Total_amount                    float64
Payment_type                      int64
Trip_type                         int64
dtype: object